Autodesk.Revit.DB.ViewDisplayEdges
A collection of settings defining how visible edges are displayed
Since:
2014

Autodesk.Revit.DB.ViewDisplayEdges.Simple
The edges are visible and drawn according to style

Autodesk.Revit.DB.ViewDisplayEdges.None
The edges are invisible